OpenFOAM-v1806/tutorials/incompressible/icoFoam/cavityMappingTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom        latestTime;

startTime       0;

stopAt           nextWrite;

endTime         0.5;

deltaT          0.005;

writeControl     timeStep;

writeInterval    1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    meshInterp1
    {
        type            mapFields;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;

        mapRegion       coarseMesh;
        mapMethod       cellVolumeWeight;
        consistent      yes;

        fields          (U); // ("U.*" "p.*");
    }
}


// ************************************************************************* //
